# FilterOperatorStr Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterOperatorAndTextString..::..FilterOperatorStr Property
FilterOperatorAndTextString Class See Also
---
A text string denoting the filter operator.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public string FilterOperatorStr { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FilterOperatorStr As String
	Get
```

Visual C++
---
```text
public:
property String^ FilterOperatorStr {
	String^ get ();
}
```

# See Also
FilterOperatorAndTextString Class
Autodesk.Revit.DB Namespace